import random

boy_first = ["Тупой", "Конченный", "Ебанутый", "Лихоеблимудый", "Пизданутый", "Высохший", "Уебищный", "Умерший",
             "Толстомудый", "Опиздолюбый", "Мелкотроемудрый", "Хуйлолюбивый", "Хуячий", "Жирномногоканальный",
             "Аналочленный"]

boy_sec = ["даун", "еблан", "пидорас", "хуйлан", "говноед", "конч", "шизик", "страходуроног", "аналомокроблядник",
           "попечитель мочалок", "лизатель червей", "духопер", "блядохероблядник", "и плюшевый муфлон",
           "долбоблядскожопый"]

girl_first = ["Тупая", "Конченная", "Ебанутая", "Блядскоеблиёбая", "Гнусная",
              "Жирная", "Токсичная", "Обтраханная", "Ебаная", "Задротская", "Горбатая", "Малость многострахоблядская",
              "Хуйлодуроблядская", "Соплежопая", "Мудоскотоебая"]

girl_sec = ["хуйня", "залупа", "манда", "шлюха", "лихохуярка", "блядь",
            "залупоеблогнойница", "выхухоль", "пидораска", "ебланка", "нервостенничка", "мозгоебка", "дермоблядунья",
            "низтроехериница", "приятельница червей"]


def generate(is_boy):
    random_first = random.randint(0, 14)
    random_sec = random.randint(0, 14)

    if is_boy:
        return f'{boy_first[random_first]} {boy_sec[random_sec]}'

    return f'{girl_first[random_first]} {girl_sec[random_sec]}'
